; domain
(define (domain vincentland)
	(:predicates
		(location ?l)
		(item ?i)
		(character ?c)
		(has ?cl ?i)
		(at ?c ?l)
		(player ?p))

	(:action move
		:parameters  (?p ?to ?from)
		:precondition (and (location ?to) (location ?from) (player ?p) (at ?p ?from))
		:effect (and (at ?p ?to) (not (at ?p ?from))))

	(:action getfromlocation
   		:parameters (?p ?i ?loc)
   		:precondition (and (item ?i) (player ?p) (location ?loc) (has ?loc ?i) (at ?p ?loc))
   		:effect (has ?p ?i))

   	(:action given
   		:parameters (?charA ?p ?i ?loc)
   		:precondition (and (character ?charA) (player ?p) (item ?i) (has ?charA ?i) (location ?loc) (at ?charA ?loc) (at ?p ?loc))
   		:effect (and (has ?p ?i) (not (has ?charA ?i))))

   	(:action giveTo
   		:parameters (?p ?charB ?i ?loc)
   		:precondition (and (character ?charB) (player ?p) (item ?i) (has ?p ?i) (location ?loc) (at ?charB ?loc) (at ?p ?loc))
   		:effect (and (has ?charB ?i) (not (has ?p ?i))))
)

; problem
(define (problem blacksmith)
    (:domain vincentland)
    (:objects blacksmith you ore mine forge bakery camp)
    (:init (location mine)
          (character blacksmith)
          (location forge)
          (location bakery)
          (location camp)
          (item ore)
          (has mine ore)
          (at blacksmith forge)
          (player you)
          (at you bakery))

    (:goal (and (has blacksmith ore)
            (at blacksmith forge)))
)

; plan
1. (move you mine bakery)
   deleted: (at you bakery)
   added: (at you mine)
   goals met: 1 of 2
2. (getfromlocation you ore mine)
   added: (has you ore)
   goals met: 1 of 2
3. (move you forge mine)
   deleted: (at you mine)
   added: (at you forge)
   goals met: 1 of 2
4. (giveto you blacksmith ore forge)
   deleted: (has you ore)
   added: (has blacksmith ore)
   goals met: 2 of 2
